// localized port names

"ether"                   = "إيثرنت";
"multiether"              = "إيثرنت %@";
"pci-ether"               = "فتحة PCI إيثرنت %@";
"pci-multiether"          = "فتحة PCI إيثرنت %@، المنفذ %@";
"thunderbolt-ether"       = "فتحة Thunderbolt إيثرنت %@";
"thunderbolt-multiether"  = "فتحة Thunderbolt إيثرنت %@، المنفذ %@";
"usb-ether"               = "إيثرنت USB (%@)";
"generic-ether"           = "محوّل إيثرنت (%@)";

"airport"                 = "Wi-Fi";
"generic-wireless"        = "محوّل الشبكة اللاسلكية (%@)";

"firewire"                = "FireWire";
"pci-firewire"            = "فتحة PCI FireWire %@";
"pci-multifirewire"       = "فتحة PCI FireWire %@، المنفذ %@";
"thunderbolt-firewire"    = "فتحة ‫Thunderbolt FireWire ‫%@‬";
"thunderbolt-multifirewire" = "فتحة ‫Thunderbolt FireWire ‫%@‬، المنفذ %@";
"generic-firewire"        = "محوّل FireWire ‏(%@)";

"bluetooth"               = "تشغيل Bluetooth";
"bluetooth-modem"         = "محوّل مودم Bluetooth USB";
"bluetooth-modem-port"    = "منفذ مودم Bluetooth";
"generic-bluetooth-modem" = "مودم Bluetooth (%@)";

"bluetooth-pan-gn"        = "Bluetooth PAN";
"bluetooth-pan-nap"       = "Bluetooth PAN-NAP";
"bluetooth-pan-u"         = "Bluetooth P2P";

"irda"                    = "IrDA";
"irda-ircomm"             = "محوّل مودم IrDA USB";
"irda-ircomm-port"        = "منفذ مودم IrDA";

"loopback"                = "استرجاع";

"modem"                   = "المودم الداخلي";

"modem-port"              = "منفذ المودم";
"modem-printer-port"      = "منفذ المودم/الطابعة";

"printer-port"            = "منفذ الطابعة";
"serial-port"             = "المنفذ التسلسلي";

"usbmodem"                = "مودم USB"; 
"generic-usbmodem"        = "مودم USB (%@)"; 

"wwan"                    = "WWAN"; 

"bond"                    = "قيد إيثرنت (%@)";

"bridge"                  = "جسر (%@)";

"vlan"                    = "VLAN (%@)";

"ipv4"                    = "IPv4";

"l2tp"                    = "L2TP";

"pptp"                    = "PPTP";

"6to4"                    = "6to4";

"ipsec"                   = "IPSec";

"vpn"                     = "VPN (%@)";

// port names (from drivers) that would be good to localize

"AppleTV"                 = "Apple TV USB";

"Display Ethernet"        = "عرض الإيثرنت";
"Display FireWire"        = "عرض FireWire";

"External Modem"          = "المودم الخارجي";

"iPad"                    = "iPad USB";

"iPhone"                  = "iPhone USB";

"iPod"                    = "iPod USB";

"USB Ethernet"            = "إيثرنت USB";
"USB Gigabit Ethernet"    = "إيثرنت جيجابت USB";

// older ("Built-in", HI changed) localizations

"X-airport"               = "AirPort";
"X-ether"                 = "داخل Ethernet";
"X-multiether"            = "داخل Ethernet %@";
"X-firewire"              = "داخل FireWire";
"X-bluetooth"             = "Bluetooth";
"X-iPhone"                = "iPhone";
